tap "equalsraf/neovim-qt"
tap "felixkratz/formulae"
tap "jackielii/tap"
tap "jesseduffield/lazygit"
tap "koekeishiya/formulae"
tap "maciejwalkowiak/brew"
tap "nikitabobko/tap"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "qmk/qmk"
tap "testingisdocumenting/brew"
tap "wimdeblauwe/ttcli"
brew "xz"
brew "asitop"
brew "ast-grep"
brew "autojump"
brew "awscli"
brew "bottom"
brew "caddy"
brew "cairo"
brew "ccusage"
brew "curl"
brew "docker"
brew "eza"
brew "fd"
brew "fish"
brew "fzf"
brew "gdu"
brew "gh"
brew "ghi"
brew "harfbuzz"
brew "libarchive"
brew "pango"
brew "ghostscript"
brew "git"
brew "git-delta"
brew "git-machete"
brew "glow"
brew "go"
brew "openjdk"
brew "gradle"
brew "h2"
brew "httpie"
brew "httpstat"
brew "hugo"
brew "hurl"
brew "icdiff"
brew "jpeg-xl"
brew "jq"
brew "keychain"
brew "kubernetes-cli"
brew "kubevpn"
brew "lazygit"
brew "libtool"
brew "lua"
brew "luajit"
brew "luarocks"
brew "maven"
brew "mysql"
brew "neovim"
brew "nvm"
brew "pkgconf"
brew "pnpm"
brew "poppler"
brew "powerlevel10k"
brew "pyenv"
brew "pyenv-virtualenv"
brew "python@3.11"
brew "redis", restart_service: :changed
brew "ripgrep"
brew "ripgrep-all"
brew "rust"
brew "stow"
brew "thefuck"
brew "tmux"
brew "tree"
brew "tree-sitter"
brew "up"
brew "uv"
brew "vercel-cli"
brew "virtualenv"
brew "walk"
brew "wget"
brew "yarn"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "felixkratz/formulae/borders"
brew "felixkratz/formulae/sketchybar"
brew "koekeishiya/formulae/skhd"
cask "claude-code"
cask "font-d2coding"
cask "ghostty"
cask "hammerspoon"
cask "ngrok"
cask "orbstack"
brew "zoxide"
brew "broot"
brew "bat"
brew "flutter"
brew "ruby"
